#include "z_boss_tw.h"

#define FLAGS 0x00000035

#define THIS ((BossTw*)thisx)

void BossTw_Init(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Destroy(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Update(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Draw(Actor* thisx, GlobalContext* globalCtx);
void func_80946B00(Actor* thisx, GlobalContext* globalCtx);
void func_80946C7C(Actor* thisx, GlobalContext* globalCtx);
void func_80947240(Actor* thisx, GlobalContext* globalCtx);
void func_80940D48(Actor* thisx, GlobalContext* globalCtx);
void func_80945084(Actor* thisx, GlobalContext* globalCtx);

void func_809453EC(BossTw* this, GlobalContext* globalCtx);
void func_80945D14(BossTw* this, GlobalContext* globalCtx);
void func_8093EE10(BossTw* this, GlobalContext* globalCtx);
void func_8093A0A8(BossTw* this, GlobalContext* globalCtx);
void func_8093D54C(BossTw* this, GlobalContext* globalCtx);
void func_8093C824(BossTw* this, GlobalContext* globalCtx);
void func_8093D58C(BossTw* this, GlobalContext* globalCtx);

extern AnimationHeader D_06006F28;
extern SkeletonHeader D_060070E0;
extern Gfx D_06012B38;
extern Gfx D_06012CE0;
extern Gfx D_06013310;
extern Gfx D_060134B8;
extern UNK_PTR D_06013AE8;
extern UNK_PTR D_06013D68;
extern UNK_PTR D_06013E98;
extern UNK_PTR D_06013F98;
extern UNK_PTR D_06014070;
extern UNK_PTR D_06014158;
extern UNK_PTR D_06018FC0;
extern UNK_PTR D_06019938;
extern UNK_PTR D_06019D40;
extern UNK_PTR D_0601A430;
extern UNK_PTR D_0601A790;
extern UNK_PTR D_0601A998;
extern UNK_PTR D_0601BC00;
extern UNK_PTR D_0601C1C0;
extern UNK_PTR D_0601CEE0;
extern UNK_PTR D_0601DBE8;
extern UNK_PTR D_0601DDF0;
extern UNK_PTR D_0601F608;
extern SkeletonHeader D_0601F888;
extern AnimationHeader D_060244B4;
extern SkeletonHeader D_06032020;

const ActorInit Boss_Tw_InitVars = {
    ACTOR_BOSS_TW,
    ACTORTYPE_BOSS,
    FLAGS,
    OBJECT_TW,
    sizeof(BossTw),
    (ActorFunc)BossTw_Init,
    (ActorFunc)BossTw_Destroy,
    (ActorFunc)BossTw_Update,
    (ActorFunc)BossTw_Draw,
};

Vec3f D_8094A7DC = { 0.0f, 0.0f, 0.0f };

// D_8094A7E8
static ColliderCylinderInit sCylinderInit1 =
{
    { COLTYPE_UNK10, 0x39, 0x09, 0x09, 0x10, COLSHAPE_CYLINDER },
    { 0x00, { 0xFFCFFFFF, 0x00, 0x30 }, { 0x00100000, 0x00, 0x00 }, 0x01, 0x01, 0x01 },
    { 25, 35, -17, { 0, 0, 0 } },
};

// D_8094A814
static ColliderCylinderInit sCylinderInit2 =
{
    { COLTYPE_UNK3, 0x11, 0x09, 0x09, 0x10, COLSHAPE_CYLINDER },
    { 0x00, { 0xFFCFFFFF, 0x00, 0x20 }, { 0xFFCDFFFE, 0x00, 0x00 }, 0x01, 0x01, 0x01 },
    { 45, 120, -30, { 0, 0, 0 } },
};

// D_8094A840
static ColliderCylinderInit sCylinderInit3 =
{
    { COLTYPE_UNK3, 0x11, 0x09, 0x39, 0x10, COLSHAPE_CYLINDER },
    { 0x00, { 0xFFCFFFFF, 0x00, 0x20 }, { 0xFFCDFFFE, 0x00, 0x00 }, 0x01, 0x05, 0x01 },
    { 45, 120, -30, { 0, 0, 0 } },
};

u8 D_8094A89C = 0x00;

// D_8094A8A0
static InitChainEntry sInitChain[] = {
    ICHAIN_U8(unk_1F, 5, ICHAIN_CONTINUE),
    ICHAIN_F32_DIV1000(gravity, 0, ICHAIN_CONTINUE),
    ICHAIN_F32(unk_4C, 0, ICHAIN_STOP),
};

s16 D_8094A900[] = {
    0x0000, 0x0001, 0x0002, 
    0x0002, 0x0001, 0x0000
};

Vec3f D_8094A920 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094A92C = { 0.0f, 0.0f, 0.0f };

Vec3f D_8094A944 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094A950 = { 0.0f, 2000.0f, -2000.0f };
Vec3f D_8094A95C = { 0.0f, 0.0f, -10000.0f };
Vec3f D_8094A968 = { 0.0f, 0.0f, -8000.0f};
Vec3f D_8094A974 = { 0.0f, 0.0f, -9000.0f};
Vec3f D_8094A980 = { 0.0f, 0.0f, -11000.0f};
Vec3f D_8094A98C = { 0.0f, 0.0f, -12000.0f};

UNK_PTR D_8094A998[] = { 0x0600A438, 0x0600B238, 0x0600B638 };
Vec3f D_8094A9A4 = { 0.0f, 200.0f, 2000.0f };

s8 D_8094C840;
u8 D_8094C841;
Actor* D_8094C844;
Actor* D_8094C848;
BossTw* D_8094C84C;
u8 D_8094C850;
u16 D_8094C851;
f32 D_8094C854;
f32 D_8094C858;
u8 D_8094C85C;
u8 D_8094C85D;
u8 D_8094C85E;
u8 D_8094C85F;
Vec3f D_8094C860;
s16 D_8094C86C;
u8 D_8094C86E;
u8 D_8094C86F;
u8 D_8094C870;
u16 D_8094C872;
u16 D_8094C874;
u16 D_8094C876;
u8 D_8094C878;
u16 D_8094C87A;
s16 D_8094C87C;
u8 D_8094C87E;
typedef struct {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ s8 unk_01;
    /* 0x04 */ Vec3f unk_04;
    /* 0x10 */ Vec3f unk_10;
    /* 0x1C */ Vec3f unk_1C;
    /* 0x28 */ char unk_28[0x4];
    /* 0x2C */ s16 unk_2C;
    /* 0x2E */ s16 unk_2E;
    /* 0x30 */ s16 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ s32 unk_44;
} BossTw1; // size = 0x48

BossTw1 D_8094C880[0x96];

#ifdef NON_MATCHING
// Regalloc on the ZeroFloat
void func_80938CD0(GlobalContext* globalCtx, Vec3f* arg1, Vec3f* arg2, Vec3f* arg3, f32 arg4, s16 arg5, s16 arg6) {
    s16 i;
    BossTw1* ptr = (BossTw1*)globalCtx->unk_11E10;
    

    for (i = 0; i < arg6; i++) {
        if (ptr->unk_00 == 0) {
            ptr->unk_00 = 1;
            ptr->unk_04 = *arg1;
            ptr->unk_10 = *arg2;
            ptr->unk_1C = *arg3;
            ptr->unk_34 = arg4 / 1000.0f;
            ptr->unk_2C = 0xFF;
            ptr->unk_01 = Math_Rand_ZeroFloat(10.0f);
            ptr->unk_2E = arg5;
            break;
        }
        ptr++;
    }
}
#else
#pragma GLOBAL_ASM("asm/non_matchings/overlays/actors/ovl_Boss_Tw/func_80938CD0.s")
#endif

#ifdef NON_MATCHING
// Regalloc on the ZeroFloat
