#include "z_boss_tw.h"

#define FLAGS 0x00000035

#define THIS ((BossTw*)thisx)

void BossTw_Init(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Destroy(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Update(Actor* thisx, GlobalContext* globalCtx);
void BossTw_Draw(Actor* thisx, GlobalContext* globalCtx);
void func_80946B00(Actor* thisx, GlobalContext* globalCtx);
void func_80946C7C(Actor* thisx, GlobalContext* globalCtx);
void func_80947240(Actor* thisx, GlobalContext* globalCtx);
void func_80940D48(Actor* thisx, GlobalContext* globalCtx);
void func_80945084(Actor* thisx, GlobalContext* globalCtx);

void func_809453EC(BossTw* this, GlobalContext* globalCtx);
void func_80945D14(BossTw* this, GlobalContext* globalCtx);
void func_8093EE10(BossTw* this, GlobalContext* globalCtx);
void func_8093A0A8(BossTw* this, GlobalContext* globalCtx);
void func_8093D54C(BossTw* this, GlobalContext* globalCtx);
void func_8093C824(BossTw* this, GlobalContext* globalCtx);
void func_8093D58C(BossTw* this, GlobalContext* globalCtx);
void func_80948668(GlobalContext* globalCtx);
void func_8093B1AC(BossTw* this, GlobalContext* globalCtx);
void func_80939F88(BossTw* this, GlobalContext* globalCtx);
void func_8093A2AC(BossTw* this, GlobalContext* globalCtx);
void func_8093A4DC(BossTw* this, GlobalContext* globalCtx);
void func_8093C858(BossTw* this, GlobalContext* globalCtx);


extern AnimationHeader D_06006F28;
extern SkeletonHeader D_060070E0;
extern AnimationHeader D_06007688;

extern SkeletonHeader D_0601F888;
extern AnimationHeader D_060244B4;
extern Gfx D_0602D890[];
extern Gfx D_0602D940[];
extern SkeletonHeader D_06032020;

const ActorInit Boss_Tw_InitVars = {
    ACTOR_BOSS_TW,
    ACTORTYPE_BOSS,
    FLAGS,
    OBJECT_TW,
    sizeof(BossTw),
    (ActorFunc)BossTw_Init,
    (ActorFunc)BossTw_Destroy,
    (ActorFunc)BossTw_Update,
    (ActorFunc)BossTw_Draw,
};

Vec3f D_8094A7DC = { 0.0f, 0.0f, 0.0f };

// D_8094A7E8
static ColliderCylinderInit sCylinderInit1 =
{
    { COLTYPE_UNK10, 0x39, 0x09, 0x09, 0x10, COLSHAPE_CYLINDER },
    { 0x00, { 0xFFCFFFFF, 0x00, 0x30 }, { 0x00100000, 0x00, 0x00 }, 0x01, 0x01, 0x01 },
    { 25, 35, -17, { 0, 0, 0 } },
};

// D_8094A814
static ColliderCylinderInit sCylinderInit2 =
{
    { COLTYPE_UNK3, 0x11, 0x09, 0x09, 0x10, COLSHAPE_CYLINDER },
    { 0x00, { 0xFFCFFFFF, 0x00, 0x20 }, { 0xFFCDFFFE, 0x00, 0x00 }, 0x01, 0x01, 0x01 },
    { 45, 120, -30, { 0, 0, 0 } },
};

// D_8094A840
static ColliderCylinderInit sCylinderInit3 =
{
    { COLTYPE_UNK3, 0x11, 0x09, 0x39, 0x10, COLSHAPE_CYLINDER },
    { 0x00, { 0xFFCFFFFF, 0x00, 0x20 }, { 0xFFCDFFFE, 0x00, 0x00 }, 0x01, 0x05, 0x01 },
    { 45, 120, -30, { 0, 0, 0 } },
};

u8 D_8094A89C = 0x00;

// D_8094A8A0
static InitChainEntry sInitChain[] = {
    ICHAIN_U8(unk_1F, 5, ICHAIN_CONTINUE),
    ICHAIN_F32_DIV1000(gravity, 0, ICHAIN_CONTINUE),
    ICHAIN_F32(unk_4C, 0, ICHAIN_STOP),
};

Vec3f D_8094A8AC[] = {
    {600.0f, 400.0f, 0.0f}, 
    {0.0f, 400.0f, 600.0f}, 
    {-600.0f, 400.0f, 0.0f}, 
    {0.0f, 400.0f, -600.0f}, 
};

s16 D_8094A900[] = {
    0x0000, 0x0001, 0x0002, 
    0x0002, 0x0001, 0x0000
};

Vec3f D_8094A920 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094A92C = { 0.0f, 0.0f, 0.0f };

Vec3f D_8094A944 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094A950 = { 0.0f, 2000.0f, -2000.0f };
Vec3f D_8094A95C = { 0.0f, 0.0f, -10000.0f };
Vec3f D_8094A968 = { 0.0f, 0.0f, -8000.0f};
Vec3f D_8094A974 = { 0.0f, 0.0f, -9000.0f};
Vec3f D_8094A980 = { 0.0f, 0.0f, -11000.0f};
Vec3f D_8094A98C = { 0.0f, 0.0f, -12000.0f};

UNK_PTR D_8094A998[] = { 0x0600A438, 0x0600B238, 0x0600B638 };
Vec3f D_8094A9A4 = { 0.0f, 200.0f, 2000.0f };
UNK_PTR D_8094A9B0[] = { 0x0602A9B0, 0x0602A070, 0x0602A470 };
Vec3f D_8094A9BC = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094A9C8 = { 0.0f, 2000.0f, -2000.0f };
Vec3f D_8094A9D4 = { 13000.0f, 0.0f, 0.0f };
Vec3f D_8094A9E0 = { 13000.0f, 0.0f, 0.0f };
Vec3f D_8094A9EC = { 0.0f, 200.0f, 2000.0f };
Vec3f D_8094A9F8 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094AA04 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094AA10 = { 0.0f, 0.0f, 0.0f };
Vec3f D_8094AA1C = { 0.0f, 0.0f, 0.0f };

s8 D_8094C840;
u8 D_8094C841;
BossTw* D_8094C844;
BossTw* D_8094C848;
BossTw* D_8094C84C;
u8 D_8094C850;
u8 D_8094C851;
f32 D_8094C854;
f32 D_8094C858;
u8 D_8094C85C;
u8 D_8094C85D;
u8 D_8094C85E;
u8 D_8094C85F;
Vec3f D_8094C860;
s16 D_8094C86C;
u8 D_8094C86E;
u8 D_8094C86F;
u8 D_8094C870;
s16 D_8094C872;
u16 D_8094C874;
u16 D_8094C876;
u8 D_8094C878;
u16 D_8094C87A;
s16 D_8094C87C;
u8 D_8094C87E;
typedef struct {
    /* 0x00 */ u8 unk_00;
    /* 0x01 */ s8 unk_01;
    /* 0x04 */ Vec3f unk_04;
    /* 0x10 */ Vec3f unk_10;
    /* 0x1C */ Vec3f unk_1C;
    /* 0x28 */ char unk_28[0x4];
    /* 0x2C */ s16 unk_2C;
    /* 0x2E */ s16 unk_2E;
    /* 0x30 */ s16 unk_30;
    /* 0x34 */ f32 unk_34;
    /* 0x38 */ f32 unk_38;
    /* 0x3C */ f32 unk_3C;
    /* 0x40 */ f32 unk_40;
    /* 0x44 */ s32 unk_44;
} BossTw1; // size = 0x48

BossTw1 D_8094C880[0x96];

void func_80939070(GlobalContext* globalCtx, Vec3f* arg1, Vec3f* arg2, Vec3f* arg3, f32 arg4, s16 arg5);
void func_80938CD0(GlobalContext* globalCtx, Vec3f* arg1, Vec3f* arg2, Vec3f* arg3, f32 arg4, s16 arg5, s16 arg6);
void func_80939250(GlobalContext* globalCtx, Vec3f* arg1, Vec3f* arg2, Vec3f* arg3, f32 arg4, f32 arg5, s16 arg6, s16 arg7);
void func_80938DC4(GlobalContext* globalCtx, s16 arg1, Vec3f* arg2, Vec3f* arg3, Vec3f* arg4, f32 arg5, s16 arg6, s16 arg7, s16 arg8);

void func_80938CD0(GlobalContext* globalCtx, Vec3f* arg1, Vec3f* arg2, Vec3f* arg3, f32 arg4, s16 arg5, s16 arg6) {
    s16 i;
    BossTw1* ptr = (BossTw1*)globalCtx->unk_11E10;
    
    for (i = 0; i < arg6; i++) {
        if (ptr->unk_00 == 0) {
            ptr->unk_00 = 1;
            ptr->unk_04 = *arg1;
            ptr->unk_10 = *arg2;
            ptr->unk_1C = *arg3;
            ptr->unk_34 = arg4 / 1000.0f;
