/*
 * File: z_fishing.c
 * Overlay: ovl_Fishing
 * Description: Fishing Pond man and Fish
 */

#include "z_fishing.h"

#define FLAGS 0x00000010

#define THIS ((Fishing*)thisx)

void Fishing_Init(Actor* thisx, GlobalContext* globalCtx);
void Fishing_Destroy(Actor* thisx, GlobalContext* globalCtx);
void Fishing_Update(Actor* thisx, GlobalContext* globalCtx);
void Fishing_Draw(Actor* thisx, GlobalContext* globalCtx);

typedef struct {
    /* 0x00 */ char unk_00[0x24];
    /* 0x24 */u8   unk_24;
    /* 0x25 */char unk_25[0x1B];
} FishingStruct1; // size = 0x40

typedef struct {
    /* 0x00 */char unk_00[0x30];
    /* 0x30 */u8   unk_30;
    /* 0x31 */char unk_31[0xB];
} FishingStruct2; // size = 0x3C

typedef struct {
    /* 0x00 */s8 unk_00;
    /* 0x01 */s8 unk_01;
    /* 0x02 */s16 unk_02;
    /* 0x04 */Vec3f unk_04;
    ///* 0x08 */f32 unk_08;
    ///* 0x0C */f32 unk_0C;
    /* 0x10 */Vec3f unk_10;
    ///* 0x14 */f32 unk_14;
    ///* 0x18 */f32 unk_18;
    /* 0x1C */char unk_1C[0x20];
    /* 0x3C */s16 unk_3C;
    /* 0x3E */s16 unk_3E;
    /* 0x40 */s16 unk_40;
    /* 0x42 */char unk_42[0x6];
} FishingStruct3; // size = 0x48


extern AnimationHeader  D_0600007C;
extern SkeletonHeader   D_060029C0;
extern AnimationHeader  D_0600453C;
extern SkeletonHeader   D_060085F8;
extern AnimationHeader  D_0600CFE0;
extern SkeletonHeader   D_06011058;

static Fishing*         D_80B7E070;
static u8               D_80B7E074;
static u8               D_80B7E075;
static u8               D_80B7E076;
static u8               D_80B7E077;
static f32              D_80B7E078;
static u8               D_80B7E07C;
static u8               D_80B7E07D;
static s8               D_80B7E07E;
static s16              D_80B7E080;
static u16              D_80B7E084;
static s16              D_80B7E086;
static s8               D_80B7E088;
static s16              D_80B7E0A4;
static s16              D_80B7E0A6;
static Fishing*         D_80B7E0A8;
static s16              D_80B7E0AC;
static s16              D_80B7E0AE;
static s16              D_80B7E0B0;
